fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>EnumRef.ВКМ_Сценарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Объект.Год = Параметры.Год;
	Объект.Дата = Параметры.Дата;
	Объект.Номер = Параметры.Номер;
	Объект.Сценарий = Параметры.Сценарий;
	
	АвтоЗаголовок = Ложь;
	Заголовок = "Анализ графика (" + Параметры.ЗаголовокФормы + ")";
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыДанных);
	СформироватьДиаграммуГанта(ТаблицаДанных);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДиаграммуГанта(ТаблицаДанных)

	АнализГрафика.Обновление = Ложь;
	АнализГрафика.Очистить();
	
	АнализГрафика.АвтоОпределениеПолногоИнтервала = Ложь;
	АнализГрафика.УстановитьПолныйИнтервал(Дата(Объект.Год, 1, 1), Дата(Объект.Год, 12, 31));
	
	Для Каждого Строка Из ТаблицаДанных Цикл

		ТочкаСотрудник = АнализГрафика.УстановитьТочку(Строка.Сотрудник);
		ТочкаСотрудник.Текст = Строка.Сотрудник;

		СерияОтпуск = АнализГрафика.УстановитьСерию("Отпуск");
		СерияОтпуск.Текст = "Отпуск";

		Значение = АнализГрафика.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);

		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);

	КонецЦикла;
	
	АнализГрафика.Обновление = Истина;

КонецПроцедуры
#КонецОбласти
